# TotalLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..TotalLength Property
RebarContainerItem Class See Also
---
The length of an individual bar multiplied by Quantity.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double TotalLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalLength As Double
	Get
```

Visual C++
---
```text
public:
property double TotalLength {
	double get ();
}
```

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace